<?php

$money_all = 23000;
$money1000 = 10;
$money500 = 20;
$money100 = 30;
$a1000 = (1000*$money1000);
$a500 = (500*$money500);
$a100 = (100*$money100);

$balance = $_POST['balance'];
$m_all = $a1000 + $a500 + $a100 ;
$chint = ($balance/100); //ถ้าน้อยกว่า 0 แสดงว่าต่ำกว่า 100 บาท
//---------------------------------------------

if(!(is_int($chint)))
{
    echo 'ต้องถอนเป็นจำนวนเต็ม ขั้นต่ำ 100 บาท ';
}
else if($balance <= $money_all && $balance>=100)
// จำนวนเงินที่ถอนต้องอยู่ระหว่างเงินที่เหลือ
{
 echo 'ยอดเงินในบัญชี '.$money_all.' บาท<br>';
        echo 'ถอนเงินจำนวน '.$balance.' บาท มีธนบัตรดังนี้<hr>';

 //เริ่มตรวจสอบเงินแบ้งค์ 1000---------------------------------------------
        if($balance>=1000)
 {
            $a = (int)($balance/1000);
            if($a>$money1000)
     {
                  $a1000 = $money1000;
            }
             else
      {
                 $a1000 = $a;
             }

           echo 'แบ้งค์ 1000 จำนวน '. $a1000 .' ใบ' ;
           $a_result = ($balance-($a1000*1000));
           echo ' เหลือ  '.$a_result;
           echo '<br />';
  }
        //จบการตรวจสอบแบ้งค์ 1000 ---------------------------------------------


        //รับค่าเงินที่เหลือจากการตรวจสอบแบ้งค์ 1000 มาตรวจแบ้ง 500 -----------------------
         if($balance>=500)
  {
    if($balance>=500 && $balance<1000)
    {
             $a_result = $balance;
    }

            $b = (int)($a_result/500);
           if($b>$money500)
      {
            $b500 = $money500;
             }
             else
             {
               $b500 = $b;
             }
     // ถ้าไม่มีเงินเหลือจากการตรวจแบ้งค์ 1000 และถ้าหากเงินที่เหลือมีน้อยกว่า 500 จะไม่ทำการประมวลผล
             if($a_result!=0 && $b500!=0)
       {
                echo 'แบ้งค์ 500 จำนวน '. $b500.' ใบ ';
                $b_result = ($a_result-($b500*500));
                echo ' เหลือ  '. $b_result;
                echo '<br />';
       }
 }
  // จบการตรวจสอบแบ้ง 500 ---------------------------------------------


  // เริ่มการตรวจสอบสำหรับแบ้งค์ 100 --------------------------
 // ถ้าไม่มีเงินเหลือจากระบบตรวจ 1000 และ 500 ก็ไม่ต้องประมวลผล 100

          if($balance<500 || $a_result!=0)
   {
              if($a_result<500 && $a_result!=0)
       {
                   $b_result = $a_result;
              }
              else if($balance<500)
       {
    $b_result = $balance;
        }

           $c = (int)($b_result/100);
           if($c>$money100)
    {
                $c100 = $money100;
           }
            else
    {
                $c100 = $c;
           }

                 if($b_result!=0)
  {
                     echo 'แบ้งค์ 100 จำนวน '. $c100.' ใบ ';
                     $c_result = ($b_result-($c100*100));
                     echo '  เหลือ  '.$c_result;
 }
  }
         // จบ การเช็คแบ้งค์ 100 ---------------------------

}
else if($balance > $money_all)
{
    echo 'จำนวนเงินไม่พอที่จะถอน คุณมีเงินจำนวน '.$money_all.' บาท';
}
else
{
    echo 'ต้องถอนขั้นต่ำ 100 บาท';
}

//---------------------------------------------

?>
